emacs.org
# -*- mode: org; -*-
#+TITLE: GNU Emacs Configuration
#+AUTHOR: Sohaib Mahmood
#+STARTUP: show2levels indent
#+EXCLUDE_TAGS: noexport
#+VERSION: 1.2.0
This is the configuration for my personal GNU Emacs setup.
* Table of Contents :TOC_2_gh:noexport:
- [[#early-emacs-initialization][Early Emacs Initialization]]
  - [[#header][Header]]
  - [[#xdg-directory][XDG Directory]]
  - [[#optimize-startup-time][Optimize Startup Time]]
  - [[#configure-byte-compile][Configure Byte Compile]]
  - [[#runtime-optimizations][Runtime optimizations]]
  - [[#footer][Footer]]
- [[#emacs-initialization][Emacs Initialization]]
  - [[#header-1][Header]]
  - [[#general-defaults][General Defaults]]
  - [[#functions][Functions]]
  - [[#keymaps][Keymaps]]
  - [[#modes][Modes]]
  - [[#packages][Packages]]
  - [[#system-configuration][System Configuration]]
  - [[#footer-1][Footer]]
- [[#org][Org]]
  - [[#header-2][Header]]
  - [[#org-defaults][Org Defaults]]
  - [[#styling][Styling]]
  - [[#note-taking][Note Taking]]
  - [[#agenda][Agenda]]
  - [[#finance][Finance]]
  - [[#footer-2][Footer]]
- [[#user-interface][User Interface]]
  - [[#header-3][Header]]
  - [[#ui-defaults][UI Defaults]]
  - [[#appearance][Appearance]]
  - [[#line-guides][Line Guides]]
  - [[#mode-line][Mode Line]]
  - [[#footer-3][Footer]]
- [[#user-experience][User Experience]]
  - [[#header-4][Header]]
  - [[#ux-defaults][UX Defaults]]
  - [[#ux-completion][UX Completion]]
  - [[#window-management][Window Management]]
  - [[#buffer-management][Buffer Management]]
  - [[#file-management][File Management]]
  - [[#footer-4][Footer]]
- [[#user-editing][User Editing]]
  - [[#header-5][Header]]
  - [[#editing-defaults][Editing Defaults]]
  - [[#navigation][Navigation]]
  - [[#text-manipulation][Text Manipulation]]
  - [[#parenthesis][Parenthesis]]
  - [[#inline-completion][Inline Completion]]
  - [[#undoredo][Undo/Redo]]
  - [[#spell-checking][Spell Checking]]
  - [[#footer-5][Footer]]
- [[#user-development][User Development]]
  - [[#header-6][Header]]
  - [[#shell--remote-access][Shell & Remote Access]]
  - [[#version-control][Version Control]]
  - [[#language-server-protocol][Language Server Protocol]]
  - [[#code-feedback--hints][Code Feedback & Hints]]
  - [[#virtualization][Virtualization]]
  - [[#snippets][Snippets]]
  - [[#footer-6][Footer]]
- [[#user-languages][User Languages]]
  - [[#header-7][Header]]
  - [[#markup--configuration][Markup & Configuration]]
  - [[#scripting][Scripting]]
  - [[#application-programming][Application Programming]]
  - [[#software-programming][Software Programming]]
  - [[#footer-7][Footer]]

* Early Emacs Initialization
:PROPERTIES:
:header-args: :tangle early-init.el
:END:
** Header
#+begin_src text
;; early-init.el - Sets up core settings before the first frame is created.
;; Copyright (C) 2023-2025 Sohaib Mahmood
;; Homepage: https://github.com/smahm006/emacs
;; Code:
#+end_src
** [[https://wiki.archlinux.org/title/XDG_Base_Directory][XDG Directory]]
#+begin_src emacs-lisp
  (use-package emacs
    :ensure nil
    :preface
    (defvar xdg-home (getenv "HOME"))
    (defvar xdg-state (getenv "XDG_STATE_HOME"))
    (defvar xdg-data (getenv "XDG_DATA_HOME"))
    (defvar xdg-config (getenv "XDG_CONFIG_HOME"))
    (defvar xdg-cache (getenv "XDG_CACHE_HOME"))
    (defvar xdg-lib (getenv "XDG_LIB_HOME")))
#+end_src
** Optimize Startup Time
#+begin_src emacs-lisp
  ;; We're going to increase the gc-cons-threshold to a very high number to decrease the load time and add a hook to measure Emacs startup time.
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6)

  ;; Let's lower our GC thresholds back down to a sane level.
  (add-hook 'after-init-hook
            (lambda ()
              ;; restore after startup
              (setq gc-cons-threshold (* 16 1024 1024))) 99)

  ;; Profile emacs startup
  (add-hook 'after-init-hook
            (lambda ()
              (message "🚀 Emacs loaded in %s with %d garbage collections."
                       (format "%.2f seconds"
                               (float-time
                                (time-subtract after-init-time before-init-time)))
                       gcs-done)))

  ;; Resizing the Emacs frame can be a terribly expensive part of changing the
  ;; font. By inhibiting this, we easily halve startup times with fonts that are
  ;; larger than the system default.
  (setq frame-inhibit-implied-resize t)

  ;; Ignore X resources; its settings would be redundant with the other settings
  ;; in this file and can conflict with later config (particularly where the
  ;; cursor color is concerned).
  (advice-add #'x-apply-session-resources :override #'ignore)

  ;; remove "for information about gnu emacs..." message at startup
  (advice-add #'display-startup-echo-area-message :override #'ignore)

  ;; suppress the vanilla startup screen completely. we've disabled it with
  ;; `inhibit-startup-screen', but it would still initialize anyway.
  (advice-add #'display-startup-screen :override #'ignore)

  ;; never show the hello file
  (defalias #'view-hello-file #'ignore)

  ;; Disable warnings from the legacy advice API. They aren't useful.
  (setq ad-redefinition-action 'accept)

  ;; Ignore warnings about "existing variables being aliased".
  (setq warning-suppress-types '((defvaralias) (lexical-binding)))

  ;; Unset `file-name-handler-alist' too (temporarily). Every file opened and
  ;; loaded by Emacs will run through this list to check for a proper handler for
  ;; the file, but during startup, it won’t need any of them.
  (defvar file-name-handler-alist-old file-name-handler-alist)
  (setq file-name-handler-alist nil)
  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq file-name-handler-alist file-name-handler-alist-old)))

  ;; Remove irreleant command line options for faster startup
  (setq command-line-x-option-alist nil)

  ;; Minimal UI
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src
** Configure Byte Compile
#+begin_src emacs-lisp
  ;; In noninteractive sessions, prioritize non-byte-compiled source files to
  ;; prevent the use of stale byte-code. Otherwise, it saves us a little IO time
  ;; to skip the mtime checks on every *.elc file.
  (setq load-prefer-newer t)

  ;; Ensure JIT compilation is enabled for improved performance by
  ;; native-compiling loaded .elc files asynchronously
  (setq native-comp-jit-compilation t)

  ;; Move native compilation cache directory to xdg-cache
  (when (boundp 'native-comp-eln-load-path)
    (startup-redirect-eln-cache
     (expand-file-name (format "%s/emacs/eln-cache/" xdg-cache))))

  ;; Disable certain byte compiler warnings to cut down on the noise.
  (setq byte-compile-warnings '(not free-vars unresolved noruntime lexical make-local))

  ;; Ensure that quitting only occurs once Emacs finishes native compiling,
  ;; preventing incomplete or leftover compilation files in `/tmp`.
  (setq native-comp-async-query-on-exit t)
  (setq confirm-kill-processes t)
#+end_src
** Runtime optimizations
#+begin_src emacs-lisp
  ;; PERF: A second, case-insensitive pass over `auto-mode-alist' is time wasted.
  (setq auto-mode-case-fold nil)

  ;; PERF: Disable bidirectional text scanning for a modest performance boost.
  ;;   I've set this to `nil' in the past, but the `bidi-display-reordering's docs
  ;;   say that is an undefined state and suggest this to be just as good:
  (setq-default bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right)

  ;; PERF: Disabling BPA makes redisplay faster, but might produce incorrect
  ;;   reordering of bidirectional text with embedded parentheses (and other
  ;;   bracket characters whose 'paired-bracket' Unicode property is non-nil).
  (setq bidi-inhibit-bpa t)  ; Emacs 27+ only

  ;; Reduce rendering/line scan work for Emacs by not rendering cursors or regions
  ;; in non-focused windows.
  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)

  ;; Don't ping things that look like domain names.
  (setq ffap-machine-p-known 'reject)

  ;; Emacs "updates" its ui more often than it needs to, so slow it down slightly
  (setq idle-update-delay 1.0)  ; default is 0.5

  ;; Font compacting can be terribly expensive, especially for rendering icon
  ;; fonts on Windows. Whether disabling it has a notable affect on Linux and Mac
  ;; hasn't been determined, but do it anyway, just in case. This increases memory
  ;; usage, however!
  (setq inhibit-compacting-font-caches t)

  ;; Introduced in Emacs HEAD (b2f8c9f), this inhibits fontification while
  ;; receiving input, which should help a little with scrolling performance.
  (setq redisplay-skip-fontification-on-input t)
#+end_src
** Footer
#+begin_src text
;; early-init.el end
(provide 'early-init)
#+end_src
* Emacs Initialization
:PROPERTIES:
:header-args: :tangle init.el
:END:
** Header
#+begin_src text
;; init.el - User configuration entry point for Emacs, loading custom modules and settings
;; Copyright (C) 2023-2025 Sohaib Mahmood
;; Homepage: https://github.com/smahm006/emacs
;; Code:
#+end_src
